##****************************************************************************************
##   TITLE   :  基本
##   PROJECT :
##   REMRAKS :
##****************************************************************************************
#from threading import Thread
#from socketserver import ThreadingMixIn
#from http.server import HTTPServer, BaseHTTPRequestHandler

#class ThreadingHTTPServer(ThreadingMixIn, HTTPServer):
#    pass

class SvtBase():
    ## -----------------------
    ## クラス変数
    ## クラスが持つ変数で、クラスとインスタンス両方で使えます。
    ## -----------------------

    ##=====================================================================================
    ## コンストラクタ
    ## @Parameter:
    ## @Return:
    ## @Note:
    ##=====================================================================================
    def __init__(self, name=""):
        self.name = name

    ##======================================================================================
    ## do_GET
    ## @Return:
    ## @Note:
    ##======================================================================================
    #@classmethod   # クラスメソッド
