##****************************************************************************************
##   TITLE   :  共通関数クラス
##   PROJECT :
##   REMRAKS :  Pythonのクラス内で関数を定義するときには、引数の一つ目にかならずselfを取らなければならない、という決まりがあるのです。
##
##****************************************************************************************
import os
import shutil

##////////////////////////////////////////////////
##  Class       : Common
##  Base        :
##  Note        :
##////////////////////////////////////////////////
class ComCommon:

    ## -----------------------
    ## クラス変数
    ## クラスが持つ変数で、クラスとインスタンス両方で使えます。
    ## -----------------------

    ##=====================================================================================
    ## コンストラクタ
    ## @Parameter: ｲﾝｽﾀﾝｽ変数初期値
    ## @Return: Void
    ## @Note:
    ##=====================================================================================
    def __init__(self, name):
        self.name = name
        #print(self.name)

    ##======================================================================================
    ## 文字の連結
    ## @Parameter: 入力文字列
    ## @Return: 結果文字列
    ## @Note:
    ##======================================================================================
    ## @classmethod   # クラスメソッド
    def Com_Str_Edit(self,a,b):
        c = a + b
        print("%s+%s=%s" % (a, b, c))
    ##======================================================================================
    ##
    ## @Parameter:　元、先
    ## @Return:
    ## @Note:
    ##======================================================================================
    def Com_File_Copy(self,src,dst):
        shutil.copyfile('a', 'b')
    ##======================================================================================
    ## フォルダ存在確認
    ## @Parameter: 文字列
    ## @Return: True
    ## @Note:
    ##======================================================================================
    def Com_File_Path(self,filepath):
        return print(os.path.exists(filepath))
    ##======================================================================================
    ##　ファイル名抜き出し
    ## @Parameter:List
    ## @Return: True
    ## @Note:
    ##======================================================================================
    def Com_File_Select(self,filepath):
        filepath[0] =  os.path.basename(filepath[0])
        print(filepath[0])
    ##======================================================================================
    ##　ファイル名抜き出し / 拡張子なしのファイル名
    ## @Parameter:List
    ## @Return: True
    ## @Note:
    ##======================================================================================
    def Com_File_Select2(self,filepath):
        filepath[0] =  os.path.splitext(os.path.basename(filepath[0]))[0]
        print(filepath[0])
    ##======================================================================================
    ##　
    ## @Parameter:List
    ## @Return: True
    ## @Note:
    ##======================================================================================
    def Com_File_Archive(self,dst,format,src):
        shutil.make_archive(dst, format, root_dir=src)
