##****************************************************************************************
##   TITLE   :  担当者マスタ／テーブル参照 モデル
##   SYSTEM  :
##
##   PROJECT :
##   FILE-ID :
##
##   WRITE   :  99/99/99
##   UPDATE  :
##
##   REMRAKS :
##
##****************************************************************************************
from .MdlBase import MdlBase  #from モジュール名 import スーパークラス名

class MdlEmployee(MdlBase):
    ## -----------------------
    ## クラス変数
    ## クラスが持つ変数で、クラスとインスタンス両方で使えます。
    ## -----------------------


    ##=====================================================================================
    ## コンストラクタ
    ## @Parameter: ｲﾝｽﾀﾝｽ変数初期値
    ## @Return: Void
    ## @Note:
    ##=====================================================================================
    def __init__(self, name):
        self.name = name

    ##======================================================================================
    ##
    ## @Parameter:
    ## @Return:
    ## @Note:
    ##======================================================================================
    ## @classmethod   # クラスメソッド
    def Mdl_Get(self):

        atSqlstr    =              "SELECT";
        atSqlstr    =  atSqlstr +  " *";
        atSqlstr    =  atSqlstr +  " FROM m_system;";

        Mdl_SQLExec(atSqlstr); #実行

