##****************************************************************************************
##   TITLE   :
##   SYSTEM  :
##
##   PROJECT :
##   FILE-ID :  FomTst11
##
##   WRITE   :  99/99/99
##   UPDATE  :  99/99/99
##
##   REMRAKS : https://tanuhack.com/flask-post-array/
##****************************************************************************************
# -*- coding: utf-8 -*-
from flask import Flask, render_template, request
import re

##////////////////////////////////////////////////
##  Class       : FomTest11
##  Base        :
##  Note        :
##////////////////////////////////////////////////
class FomTst11:
    app = Flask(__name__)

    ##======================================================================================
    ## POST
    ## @Return:
    ## @Note:
    ##======================================================================================
    @app.route('/', methods=['POST'])
    def post():
        # 2次元配列風の文字列をフォームから受け取る
        str2 = request.form.get('arr')

        # 文字列→1次元配列
        arr1 = re.sub('(\[|\'|\]|\s)', '', str2).split(',')

        # 区切り文字数をフォームから受け取る
        n = int(request.form.get('num'))

        # 1次元配列→2次元配列
        arr2 = [arr1[i:i + n] for i in range(0, len(arr1), n)]
        ###print("arr2", arr2, type(arr2))
        # => arr2 [['1', '2', '3'], ['a', 'b', 'c'], ['あ', 'い', 'う']]

    ##======================================================================================
    ##
    ## @Return:
    ## @Note:
    ##======================================================================================
    @app.route('/')
    def index():
        return render_template('index11.html')


    # => arr1 ['1', '2', '3', '4', '5']
    if __name__ == '__main__':
      app.debug = True
      app.run()